#include <iostream>
using namespace std;

// 确认大致的数组范围，防止数组太小、边界太紧从而发生越界
const int N = 110;

//num组物品和一个容量是V的背包
int num, V;
//[i][j] = 第i组物品第j个的：v体积 / w价值
int v[N][N], w[N][N];
/*-----状态表示f[i][j]-----*/
// 【集合】对i组物品、限定容量为j，所有可能的总价值
int f[N][N];
//第i组物品的个数
int s[N];

int main()
{
    //输入并装填元素，从1开始方便下标观察
    cin >> num >> V;
    for (int i = 1; i <= num; i++)
    {
        // 对第i组物品，有s[i]个
        cin >> s[i];

        // 对这s[i]个第i组的物品分别输入体积和价值
        for (int j = 1; j <= s[i]; j++)
        {
            cin >> v[i][j] >> w[i][j];
        }
    }

    //枚举物品组数与限定体积，都是由少到多枚举
    for (int i = 1; i <= num; i++)
    {
        for(int j = 0; j <= V; j ++)
        {
            /*-----集合运算-----*/
            // 对物品组数i与限定体积j而言，f[i][j]有两种可能
            // 1.等于限定j体积下选择i-1组物品的总价值
            // (此时第i组物品任意选一个进去都会使总体积超过j)
            // 2.等于除了第i组物品第k个以外的最大物品总价值+第i组物品第k个
            // (此时显然第i组里存在合适的物品可以放入)

            // 这里先认定情况一，后续再进行更新
            f[i][j] = f[i - 1][j];
            // 继续枚举：选择对第i组物品的第k个
            for(int k = 1; k <= s[i]; k++)
            {
                //如果限定体积j大于所选入的物品，那么更新f[i][j]的值
                if (j >= v[i][k])
                    f[i][j] = max(f[i][j], f[i - 1][j - v[i][k]] + w[i][k]);
            }
        }
    }

    // 最终所需要的答案：
    // 是同时存在num种物品时，限定(背包)总体积V，所取得的总物品价值最大值
    cout << f[num][V];
    return 0;
}